Revit 2027 API
Entity.Clear(Field) Method
 Resets the field to its default value.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Clear(
	Field field
)
Public Sub Clear (
	field As Field
)
public:
void Clear(
	Field^ field
)
member Clear :
        field : Field -> unit
Parameters
field Field
 The field to clear.
Exceptions
Exception | Condition
ArgumentException |  The Field belongs to a different Schema from this Entity, or this Entity is invalid. -or- This field's subschema prevents writing.
ArgumentNullException |  A non-optional argument was null
Remarks
 The default value is zero for numeric fields, invalid value for identifiers and entities, and empty for strings and containers.
See Also
Reference
Entity Class
Clear Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace